We are now seeing this error, which I was able to reproduce locally. I expect we'll start to see it in nightly tests soon as well:
```
=== RUN   TestAccWorkstationsWorkstationConfig_workstationConfigEncryptionKeyExample
=== PAUSE TestAccWorkstationsWorkstationConfig_workstationConfigEncryptionKeyExample
=== CONT  TestAccWorkstationsWorkstationConfig_workstationConfigEncryptionKeyExample
    provider_test.go:319: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # google_workstations_workstation_config.default must be replaced
        -/+ resource "google_workstations_workstation_config" "default" {
              ~ conditions             = [] -> (known after apply)
              ~ create_time            = "2023-03-07T17:06:03.460734712Z" -> (known after apply)
              ~ degraded               = false -> (known after apply)
              ~ etag                   = "U4dyushfjxduw7q6UB-GkgO3UqDF0QP-7A0r_BoaajA" -> (known after apply)
              ~ id                     = "projects/ci-test-project-188019/locations/us-central1/workstationClusters/tf-test-workstation-clusternnvljj9niv/workstationConfigs/tf-test-workstation-confignnvljj9niv" -> (known after apply)
              ~ name                   = "projects/ci-test-project-188019/locations/us-central1/workstationClusters/tf-test-workstation-clusternnvljj9niv/workstationConfigs/tf-test-workstation-confignnvljj9niv" -> (known after apply)
              ~ project                = "ci-test-project-188019" -> (known after apply)
              ~ uid                    = "306bf4e3-a681-4469-a971-14f398bd13c2" -> (known after apply)
                # (3 unchanged attributes hidden)
        
              ~ container {
                  ~ args        = [] -> (known after apply)
                  ~ command     = [] -> (known after apply)
                  ~ env         = {} -> (known after apply)
                  ~ image       = "us-central1-docker.pkg.dev/cloud-workstations-images/predefined/code-oss:latest" -> (known after apply)
                  ~ run_as_user = 0 -> (known after apply)
                  + working_dir = (known after apply)
                }
        
        
              ~ host {
                  ~ gce_instance {
                      ~ pool_size                   = 0 -> (known after apply)
                      - service_account             = "service-1067888929963@gcp-sa-workstationsvm.iam.gserviceaccount.com" -> null # forces replacement
                        # (3 unchanged attributes hidden)
        
                      ~ shielded_instance_config {
                          - enable_integrity_monitoring = false -> null
                            # (2 unchanged attributes hidden)
                        }
                    }
                }
        
              + persistent_directories {
                  + mount_path = (known after apply)
        
                  + gce_pd {
                      + disk_type      = (known after apply)
                      + fs_type        = (known after apply)
                      + reclaim_policy = (known after apply)
                      + size_gb        = (known after apply)
                    }
                }
                # (1 unchanged block hidden)
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccWorkstationsWorkstationConfig_workstationConfigEncryptionKeyExample (3200.11s)
FAIL
FAIL	github.com/hashicorp/terraform-provider-google-beta/google-beta	3200.150s
FAIL
```